import { Review } from '@sp/common';

export const reviews: Review[] = [
  {
    reviewer: 'Виталий',
    comment:
      'У меня действительно не так много времени, так как приходится совмещать основную работу и игру в покер. В покер играю давно, пробовал разные дисциплины, а в МТТ около 3 лет, играю АБИ 6. Несмотря на плюсовую игру и победы в турнирах, меня не покидало ощущение, что я играю плохо.<br><br>Во время просмотра промо-ролика от Саши, где показывался 8-й раздел курса Only Poker, я поймал себя на мысли, что не знаю, как действовать в таких ситуациях, но получил нужный ответ от Александра. Тогда появилось намерение приобрести данный курс. Тем более что все складывалось идеально: я пошел в отпуск на основной работе, а в конце сентября занял 2-е место в турнире за $8.88, заработав более $1100.<br><br>Проблем с приобретением курса не было. Сам курс прошел недели за две, просматривая один раздел перед сессией, а затем старался правильно применять полученную информацию на практике. В настоящее время банкролл замер на месте, каких-то больших заносов не было, но я отношусь к этому спокойно, так как прекрасно понимаю, что моя игра после прохождения курса "сломалась" в лучшую сторону. Необходимо время, чтобы все настроить в игре как надо.<br><br>Можно ли оценить курс по какой-то шкале? Лично для меня он бесценен, потому что что-то я не знал, что-то знал, но применял неправильно. Курс смог заполнить пробелы в моих знаниях. Конечно, понадобится время, чтобы все полностью осознать и правильно применять на практике.<br><br>Особый респект чартам! Это просто бомба. Чего, как мне кажется, не хватало в курсе, так это большей визуализации и примеров из реально сыгранных раздач. А в остальном — все 🔥. Рекомендую! 👍',
  },
  {
    reviewer: 'А М',
    comment:
      'На самом деле до конца курса я так и не дошел. Причина пока простая — каждую лекцию я реально пересматриваю частями по 5–6 раз, иногда порционно, потому что объем информации крайне большой. То есть даже стратегии на префлопе с разбором 5–6 ситуаций по оппонентам крайне сложно воспринять за раз, и даже после нескольких пересмотров!<br><br>Планирую ли дойти до конца? Точно да.<br><br>Насколько полезный контент? В целом после того, как информация "полежит" в голове, она становится крайне интересной. Я имею в виду: вот ты посмотрел лекцию, как любитель с опытом наигрывания 50–70 турниров в месяц, половину информации просто не смог впитать, но что-то запомнил. На следующий день посмотрел еще — и в целом материал начинает складываться в пазл.<br><br>Спасибо отдельно за ренжи. Скажу честно, что ренжи из курса на осознанном уровне понять было гораздо проще и понятнее — я по ним и играл. Здесь уже на каждую позицию свои индивидуальные сценарии. Прикольно, но теперь реально понимаешь, что нужно учить, так как не успеешь сидеть и подглядывать. Для АБИ10 все описанное в курсе хорошо работает.<br><br>Общее впечатление. В целом курс оставил положительное впечатление. Наверное, для себя понимаю, что дальше — только с тренером. Пару фишек для себя уже взял на вооружение. Например, я очень тайтовый игрок, но на дистанции стратегия всегда делать ставку на флопе на этом АБИ сразу показала себя хорошо.<br><br>Так что буду смотреть дальше, материал хороший!',
  },
  {
    reviewer: 'Алексей Ештыганов',
    comment:
      'Играю в покер около 4 лет. Катал в основном АБИ 1–2, держался около "0". Общее понимание игры было, но черпал его в основном из контента на YouTube. Сейчас играю турниры АБИ 5.<br><br>Доволен тем, что приобрел курс "Only Poker". Видео-уроки пересматривал раза три — появилось понимание того, что и где "тыкать". Полностью пересмотрел свою игру на префлопе.<br><br>Таблицы ренжей помогают проводить анализ игры после сессии на сохраненных раздачах.<br><br>Неожиданный плюс: я стал получать гораздо больше удовольствия от самой игры, и теперь неважно, в плюс или в минус я откатал сессию.<br><br>Спасибо! 🖖',
  },
  {
    reviewer: 'Валерий Стома',
    comment:
      'Сейчас я на пятом уроке, но дальше пока не получается найти время — жду зимнего периода.<br><br>Тем не менее удалось занять 2-е место и выиграть 50k ₽ в бэкинг-шоу в октябре, а также 2-е место на Покерке с призовыми $400. Знания из курса помогли в этих достижениях!',
  },
  {
    reviewer: 'MR',
    comment:
      'Я все очень тщательно изучаю и долго зачастую. Уроки записаны в тетрадку, практически дословно. ☝️ Вон он комплимент: обычно записываю главное, а тут не смог главное выделить, так как без воды. 💪 Only Покер соответствует своему названию. Александр молодчага.',
  },
];
