import { Component, OnInit } from '@angular/core';
import { CommonModule } from '@angular/common';
import { MainTopComponent } from "../main-top/main-top.component";
import { MainDiagramComponent } from "../main-diagram/main-diagram.component";
import { MainProjectComponent } from "../main-project/main-project.component";
import { MainSocialComponent } from "../main-social/main-social.component";
import { MainChoosePathComponent } from '../main-choose-path/main-choose-path.component';
import { MainReviewComponent, Review } from '@sp/common';

@Component({
  selector: 'sp-main-page',
  standalone: true,
  imports: [
    CommonModule,
    MainTopComponent,
    MainDiagramComponent,
    MainProjectComponent,
    MainReviewComponent,
    MainSocialComponent,
    MainChoosePathComponent,
  ],
  templateUrl: './main-page.component.html',
  styleUrl: './main-page.component.css',
})
export class MainPageComponent implements OnInit {
  reviews: Review[] = [];

  ngOnInit() {
    this.reviews.push(
      {
        comment: 'Понравился как сам курс, так и форма его подачи. Было не просто полезно (на мой взгляд), ' +
          'но и довольно увлекательно. Как мне кажется, можно было бы дать побольше информации на курсе. Возможно, ' +
          'даже разделить его на три части. Скорее всего, максимальное количество информации в ПРО курсе Глеба Тремзина,' +
          ' но для меня это дороговато. В любом случае спасибо за труды!',
        position: 'Курс "Осознанное начало"',
        reviewer: 'Андрей'
      }
    );
    this.reviews.push(
      {
        comment: 'Народ, бустер пушка! 🔥🔥Очень всем рекомендую! Открывает понимание на многие игровые моменты, и ты можешь правильно оценивать действия соперников! Спасибо Саше и Артему ✊🏼Все лаконично и грамотно объяснят и подскажут☝🏼<br><br>' +
          'Уверен, что стоит пройти курс не только новичкам, но и тем, кто считает себя средним регуляром. Ваши ожидания вырастут однозначно (при наличии времени и желания работать над своей игрой с учетом всей информации, полученной на бустере)!🤞🏼<br><br>' +
          'В общем, думаю, это лучшая возможность себя прокачать💪🏼💪🏼 До встречи за столами. Уверен, однозначно встретимся🤝🤝🤝\n',
        position: 'БУСТЕР',
        reviewer: 'Сергей “Joker”'
      }
    );
    this.reviews.push(
      {
        comment: 'Курс для самых новичков. Когда я его проходил, уже достаточно неплохо играл, ' +
          'но всё равно подчерпнул пару фишек, связанных с диапазонами. Не хватает углубленных стратегий ведения ' +
          'игры на постфлопе и более детального рассмотрения игровых ситуаций. А так, для новичков самое то. 7/10',
        position: 'Курс "Осознанное начало"',
        reviewer: 'Кузьминых Артур Вячеславович '
      }
    );
    this.reviews.push(
      {
        comment: 'Приобрёл курс примерно год-полтора назад, и он дал мне большой буст, который заключается в понимании игры на префлопе. Курс рассчитан на максимально начинающих игроков, кем я на тот момент и являлся. Самым ценным в курсе, считаю те самые ГТО-ренжи открытия, которые дают понимание, с какой рукой и из какой позиции нужно открываться в стеках от +50бб до 20-30бб. Также хочу отметить пуш-фолд диаграмму, которая даёт возможность плюсово, а также грамотно пушить руку на весь твой стек и не переживать, правильно ты сделал или нет. Забыл отметить не только открытия, но и колд-коллы – они также присутствуют в курсе. Курс получился максимально информативным и удобным в пользовании. Именно курс "Осознанное начало" считаю тем самым необходимым фундаментом для начинающего игрока в покер. Спасибо и низкий поклон авторам данного курса! Обнял, приподнят, покрутил, поставил на место!)',
        position: 'Курс "Осознанное начало"',
        reviewer: 'Мусаев Эмиль Теймурович '
      }
    );
    this.reviews.push(
      {
        comment: 'Курс осознанное начало был для меня вторым базовым курсом для обучения основам покера. Для новичков, которые хотя бы знают комбинации в покере, это очень полезный и познавательный курс, но не стоит рассчитывать на то, что после изучения ты станешь профи и начнёшь выигрывать всё и всех. Это далеко не так. Да, ты получишь классную баз и некоторое понимание игры, но и это произойдёт не сразу. Лично я перепроходил курс 2 раза, но это был для меня уже второй опыт. Первый курс от другой компании я перепроходил раза 3 или 4, каждый раз открывая для себя что-то новое. Самое главное помнить, что помимо доступа к курсам, нужно желание и стремление работать над собой – только так можно добиться хоть какого-то результата. Моё личное мнение, даже если у вас нет возможности получить курс – найдите её. Если вы играете уже много лет, то все равно найдите время и возможности для этого базового курса, т.к. есть вероятность того, что вы откроете для себя что-то новое и интересное, что позволит играть лучше, понимать игру лучше. Всем удачи на полях покерных сражений.',
        position: 'Курс "Осознанное начало"',
        reviewer: 'Дедюхин Александр Валерьевич'
      }
    );
    this.reviews.push(
      {
        comment: 'Прошёл курс Осознанное начало! Сам курс для новичков очень актуальный, многое становится ясным, а игра становится лучше. Также хочу отметить, что техническая поддержка работает на высоком уровне, мне всегда отвечали на мои вопросы и разъясняли все. Советую!',
        position: 'Курс "Осознанное начало"',
        reviewer: ' Сенчук Дмитрий Владимирович '
      }
    );
    this.reviews.push(
      {
        comment: 'Курс осознанное начало был довольно полезным. В нем открыл для себя немного нового, но самое ценное – это чарты, которые реально мне помогли если и не выиграть, то дойти до финальных столов. Плюс ко всему, в закрытом клубе тоже присутствовал – и там царит теплая атмосфера, где всегда подскажут. Здесь выкладываются и обсуждаются интересные раздачи. В общем, я считаю, что все эти продукты точно помогают лучше понять покер и будут полезно каждому игроку!',
        position: 'Курс "Осознанное начало"',
        reviewer: 'Кудрявцев Игорь Владимирович '
      }
    );
    this.reviews.push(
      {
        comment: 'Хотел поблагодарить всю команду, за такой замечательный проект как «БУСТЕР». Ни сколько не пожалел, что пришёл обучаться именно сюда. Ребята настоящие профессионалы своего дела. Подача материала на высочайшем уровне, индивидуальный подход к каждому ученику. Очень много полезной информации для любого уровня игроков, также большое количество обучающего видео материала. Разбор базы игрока, в котором тренера укажут на ваши ошибки и подскажут над чем работать! Результаты не заставили себя ждать и за данный месяц я оформил свой бест кэш в размере $75000+ были ещё пятизначные выигрыши и финальные столы в хороших турнирах 😎 Однозначно рекомендую данный проект!  Всем большое спасибо 😉 P.S. Оплатил очередной месяц обучения, ждём новую волну учеников и погнали 💪🏆🔥',
        position: 'БУСТЕР',
        reviewer: 'Денис “Im_goodman”'
      }
    );

    this.reviews.push(
      {
        comment: 'Случайно узнал о сервисе в телеграме. Решил рискнуть, вывел $20 - всё чётко. Два часа - и деньги на карте. На следующий раз повысил лимит до $200 - три человека забрали и оперативно перевели. В общем, рекомендую как для депозитов, так и для кэшаутов. Всё проходит быстро - саппорт откликается чуть ли не моментом',
        position: 'Пользователь обменника',
        reviewer: 'Сергей Яровой'
      }
    );
    this.reviews.push(
      {
        comment: 'Как игроку, я доверяю Глебу - решил воспользоваться его сервисом по обмену. были некоторые опасения, но всё прошло чётко: 10 минут - и денюшки пришли на карту Сбера. Так что рекомендую, а комиссию в пару процентов на выводе даже не заметил)',
        position: 'Пользователь обменника',
        reviewer: 'Ярослав Михайлов'
      }
    );

    this.reviews.push(
      {
        comment: 'Мне понравился курс. Считаю, что для новичка – это самое то! Особенно понравилось, что помимо моментов, непосредственно связанных с игрой в покер, уделяется особое внимание психологии, тильтоустойчивости и банкролл-менеджменту. Многим подойдет для старта и знакомства с покером. Информация подается сжато, четко, без воды.',
        position: 'Курс "Осознанное начало"',
        reviewer: 'Жоховец Валерий'
      }
    );

    this.reviews.push(
      {
        comment: 'Спасибо Тренерам БУСТЕРа!!! Занимаясь покером, как хобби, никогда не брал тренировки, так как считал это выбросом денег на ветер (сам справлюсь), но услышав на стриме Safepoker про БУСТЕР, решил попробовать, хотел чтобы разобрали мою базу и указали на мои ошибки и над чем нужно работать. Теперь не жалею , что вступил в БУСТЕР так как столько информации мало, где найдёшь и сам не поймёшь, как использовать её правильно. <br>' +
          'После разбора моей базы с Александром, мне рассказали мои ошибки и над чем нужно работать.<br>' +
          'Во время обучения много полезного и нового для себя открыл. Теперь, главное-продолжать тренироваться, обучаться и работать над собой.<br>' +
          'Благодарю за полученные знания, качественную информацию и с пользой затраченное время. БУСТЕР уже отбил. <br>' +
          'Огромное спасибо!!!👍 🔥',
        position: 'БУСТЕР',
        reviewer: 'Андрей'
      }
    );
  }
}
