import { ChangeDetectionStrategy, ChangeDetectorRef, Component, OnInit, QueryList, ViewChildren } from '@angular/core';
import { BreakpointObserver } from "@angular/cdk/layout";
import { TuiCarouselComponent, TuiPagination } from "@taiga-ui/kit";
import { ReviewItemComponent } from "./review-item/review-item.component";
import { CommonModule } from "@angular/common";
import { TuiItem } from "@taiga-ui/cdk";

export interface Review {
  reviewer: string;
  position: string;
  comment: string;
}

@Component({
  selector: 'sp-main-review',
  templateUrl: './main-review.component.html',
  styleUrls: ['./main-review.component.scss'],
  standalone: true,
  imports: [CommonModule, ReviewItemComponent, TuiCarouselComponent, TuiPagination, TuiItem],
  changeDetection: ChangeDetectionStrategy.OnPush
})
export class MainReviewComponent implements OnInit {

  @ViewChildren(ReviewItemComponent) items!: QueryList<ReviewItemComponent>;
  reviews: Review[] = [];
  itemsCount = 1;
  index = 0;

  constructor(private breakPointObserver: BreakpointObserver,
              private cdr: ChangeDetectorRef) {
  }

  ngOnInit(): void {
    this.reviews.push(
      {
        comment: 'Понравился как сам курс, так и форма его подачи. Было не просто полезно (на мой взгляд), ' +
          'но и довольно увлекательно. Как мне кажется, можно было бы дать побольше информации на курсе. Возможно, ' +
          'даже разделить его на три части. Скорее всего, максимальное количество информации в ПРО курсе Глеба Тремзина,' +
          ' но для меня это дороговато. В любом случае спасибо за труды!',
        position: 'Курс "Осознанное начало"',
        reviewer: 'Андрей'
      }
    );
    this.reviews.push(
      {
        comment: 'Очень нравится обучаться у лучших! Тренер Артем Софронов всегда отвечает в кратчайшие строки на ' +
          'все вопросы, на раздачи участников. Таким образом, можно учиться на примерах других игроков. ' +
          'А его разборы турниров вообще бест оф зе бест! Всегда можно спросить совет как у тренера, так и у' +
          ' единомышленников в чате телеграм-канала. Всем советую, не пожалеете, и прогресс в игре у вас будет обязательно.' +
          ' Если есть желание учится и развиваться, конечно',
        position: 'Закрытый клуб по обучению НашПокер',
        reviewer: 'Плихтяк Денис Степанович'
      }
    );
    this.reviews.push(
      {
        comment: 'Курс для самых новичков. Когда я его проходил, уже достаточно неплохо играл, ' +
          'но всё равно подчерпнул пару фишек, связанных с диапазонами. Не хватает углубленных стратегий ведения ' +
          'игры на постфлопе и более детального рассмотрения игровых ситуаций. А так, для новичков самое то. 7/10',
        position: 'Курс "Осознанное начало"',
        reviewer: 'Кузьминых Артур Вячеславович '
      }
    );
    this.reviews.push(
      {
        comment: 'Приобрёл курс примерно год-полтора назад, и он дал мне большой буст, который заключается в понимании игры на префлопе. Курс рассчитан на максимально начинающих игроков, кем я на тот момент и являлся. Самым ценным в курсе, считаю те самые ГТО-ренжи открытия, которые дают понимание, с какой рукой и из какой позиции нужно открываться в стеках от +50бб до 20-30бб. Также хочу отметить пуш-фолд диаграмму, которая даёт возможность плюсово, а также грамотно пушить руку на весь твой стек и не переживать, правильно ты сделал или нет. Забыл отметить не только открытия, но и колд-коллы – они также присутствуют в курсе. Курс получился максимально информативным и удобным в пользовании. Именно курс "Осознанное начало" считаю тем самым необходимым фундаментом для начинающего игрока в покер. Спасибо и низкий поклон авторам данного курса! Обнял, приподнят, покрутил, поставил на место!)',
        position: 'Курс "Осознанное начало"',
        reviewer: 'Мусаев Эмиль Теймурович '
      }
    );
    this.reviews.push(
      {
        comment: 'Курс осознанное начало был для меня вторым базовым курсом для обучения основам покера. Для новичков, которые хотя бы знают комбинации в покере, это очень полезный и познавательный курс, но не стоит рассчитывать на то, что после изучения ты станешь профи и начнёшь выигрывать всё и всех. Это далеко не так. Да, ты получишь классную баз и некоторое понимание игры, но и это произойдёт не сразу. Лично я перепроходил курс 2 раза, но это был для меня уже второй опыт. Первый курс от другой компании я перепроходил раза 3 или 4, каждый раз открывая для себя что-то новое. Самое главное помнить, что помимо доступа к курсам, нужно желание и стремление работать над собой – только так можно добиться хоть какого-то результата. Моё личное мнение, даже если у вас нет возможности получить курс – найдите её. Если вы играете уже много лет, то все равно найдите время и возможности для этого базового курса, т.к. есть вероятность того, что вы откроете для себя что-то новое и интересное, что позволит играть лучше, понимать игру лучше. Всем удачи на полях покерных сражений.',
        position: 'Курс "Осознанное начало"',
        reviewer: 'Дедюхин Александр Валерьевич'
      }
    );
    this.reviews.push(
      {
        comment: 'Прошёл курс Осознанное начало! Сам курс для новичков очень актуальный, многое становится ясным, а игра становится лучше. Также хочу отметить, что техническая поддержка работает на высоком уровне, мне всегда отвечали на мои вопросы и разъясняли все. Советую!',
        position: 'Курс "Осознанное начало"',
        reviewer: ' Сенчук Дмитрий Владимирович '
      }
    );
    this.reviews.push(
      {
        comment: 'Курс осознанное начало был довольно полезным. В нем открыл для себя немного нового, но самое ценное – это чарты, которые реально мне помогли если и не выиграть, то дойти до финальных столов. Плюс ко всему, в закрытом клубе тоже присутствовал – и там царит теплая атмосфера, где всегда подскажут. Здесь выкладываются и обсуждаются интересные раздачи. В общем, я считаю, что все эти продукты точно помогают лучше понять покер и будут полезно каждому игроку!',
        position: 'Курс "Осознанное начало"',
        reviewer: 'Кудрявцев Игорь Владимирович '
      }
    );
    this.reviews.push(
      {
        comment: 'После курса «осознанное начало» приобрел себе ПРО курс. Ушло пару дней на освоение и еще время на новые ренджи. Было прикольно наблюдать как меняется мое понимание игры. Приятным бонусом был месяц в закрытом клубе. В целом всем доволен, особенно результатами и новыми знакомствами. Шипиииммм!',
        position: 'Курс "Продвинутый курс"',
        reviewer: 'Паралюш Максим'
      }
    );

    this.reviews.push(
      {
        comment: 'Случайно узнал о сервисе в телеграме. Решил рискнуть, вывел $20 - всё чётко. Два часа - и деньги на карте. На следующий раз повысил лимит до $200 - три человека забрали и оперативно перевели. В общем, рекомендую как для депозитов, так и для кэшаутов. Всё проходит быстро - саппорт откликается чуть ли не моментом',
        position: 'Пользователь обменника',
        reviewer: 'Сергей Яровой'
      }
    );
    this.reviews.push(
      {
        comment: 'Как игроку, я доверяю Глебу - решил воспользоваться его сервисом по обмену. были некоторые опасения, но всё прошло чётко: 10 минут - и денюшки пришли на карту Сбера. Так что рекомендую, а комиссию в пару процентов на выводе даже не заметил)',
        position: 'Пользователь обменника',
        reviewer: 'Ярослав Михайлов'
      }
    );

    this.reviews.push(
      {
        comment: 'Мне понравился курс. Считаю, что для новичка – это самое то! Особенно понравилось, что помимо моментов, непосредственно связанных с игрой в покер, уделяется особое внимание психологии, тильтоустойчивости и банкролл-менеджменту. Многим подойдет для старта и знакомства с покером. Информация подается сжато, четко, без воды.',
        position: 'Курс "Осознанное начало"',
        reviewer: 'Жоховец Валерий'
      }
    );

    this.reviews.push(
      {
        comment: 'В клубе  не так долго! Но уже за это небольшое время, и то малое количество тренировок, проведённых Артёмом, узнал много полезного!!! Советую всем кто хочет подтянуть свою игру! Хочется больше заданий!!)))',
        position: 'Закрытый клуб по обучению НашПокер',
        reviewer: 'Константин Беляк'
      }
    );

    this.breakPointObserver.observe([
      "(min-width: 850px)"
    ]).subscribe(
      res => {
        if (res.matches) {
          this.itemsCount = 2;
        } else {
          this.itemsCount = 1;
        }
        this.index = 0;
      }
    );
  }

  get rounded(): number {
    return Math.floor(this.index / this.itemsCount);
  }

  onIndex(index: number): void {
    this.index = (index * this.itemsCount);
  }

  prev(carousel: TuiCarouselComponent) {
    for (let i = 0; i < this.itemsCount; i++) {
      carousel.prev();
    }
  }

  next(carousel: TuiCarouselComponent) {
    for (let i = 0; i < this.itemsCount; i++) {
      carousel.next();
    }
  }

  navigate(delta: number) {
    this.index = (this.index + delta) % 12;
    if (this.index < 0) {
      this.index = this.reviews.length + delta;
    }
    for (const item of this.items) {
      item.close();
    }
  }
}
